Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: རྣམ་པར་ཤེས་པ་ལ་མི་རྟག་པའི་རྣམ་པ་དང་། སྡུག་བསྔལ་བའི་རྣམ་པ་དང་། བདག་མེད་པའི་རྣམ་པ་དང་། སྟོང་པའི་རྣམ་པ་དང་། མཚན་མ་མེད་པའི་རྣམ་པ་དང་། སྨོན་པ་མེད་པའི་རྣམ་པ་དང་། ཞི་བའི་རྣམ་པ་དང་། དབེན་པའི་རྣམ་པ་དང་། རྣམ་པར་བྱང་བའི་རྣམ་པ་དང་། སྐྱེ་བ་མེད་པའི་རྣམ་པ་དང་། འགག་པ་མེད་པའི་རྣམ་པ་དང་། དངོས་པོ་མེད་པའི་རྣམ་པར་སོ་སོར་རྟོག་སྟེ།
en: Likewise, they discern that feelings, perceptions, formative predispositions, and consciousness are impermanent, imbued with suffering, not a self, empty, signless, lacking aspirations, calm, void, purified, non-arising, unceasing, and non-entities, and they do so without apprehending anything.

source: དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་རྟོག་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་དག་དང་། མི་དགེ་བའི་རྩ་བ་གང་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་ཆད་བྱེད་པ་དག་གི་སྐབས་མི་འབྱེད་པ་དེ་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ནོ། །
en: Śāradvatī­putra, this denial of opportunity for the twofold, [over-scrupulous] attentiveness possessed by śrāvakas and pratyekabuddhas, and for the roots of non-virtuous action, to impede the attainment of unsurpassed, genuinely perfect enlightenment is the transcendent perfection of meditative concentration of great bodhisattva beings when they practice the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། འདི་ལྟར་སོ་སོར་རྟོག་སྟེ། གཟུགས་ཀྱི་སྟོང་པ་ཉིད་ཀྱིས་གཟུགས་སྟོང་སྟེ། གཟུགས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་གཟུགས་སོ། །
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of wisdom, they discern that physical forms are empty of the emptiness of physical forms, that the nature of physical forms is emptiness, and that emptiness is indeed physical forms.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་ཀྱིས་རྣམ་པར་ཤེས་པ་སྟོང་སྟེ། རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །
en: Similarly, [they discern] that consciousness [and so forth] are empty of the emptiness of feelings, perceptions, formative predispositions, and consciousness; that the nature of consciousness is emptiness; and that emptiness is indeed consciousness.

source: སྟོང་པ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པའོ། །དེ་བཞིན་དུ་མིག་གི་སྟོང་པ་ཉིད་ཀྱིས་མིག་སྟོང་སྟེ། མིག་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་མིག་གོ། །
en: Similarly, [they discern] that the eyes are empty of the emptiness of the eyes, that the nature of the eyes is emptiness, and that emptiness is indeed the eyes.

source: དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་སྟོང་པ་ཉིད་ཀྱིས་ཡིད་སྟོང་སྟེ།
en: Similarly, [they discern] that the mental faculty [and so forth] are empty of the emptiness of the ears, nose, tongue, body, and mental faculty; that the nature of the mental faculty is emptiness, and that emptiness is indeed the mental faculty.

source: ཡིད་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་ཡིད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་གྱི་སྟོང་པ་ཉིད་ཀྱིས། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྟོང་སྟེ། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའོ།།
en: In the same vein, [they discern that] feelings conditioned by visually compounded sensory contact are empty of the emptiness of feelings conditioned by visually compounded sensory contact, and so forth, that the nature of feelings conditioned by visually compounded sensory contact is emptiness, and that emptiness is indeed feelings conditioned by visually compounded sensory contact.

source: དེ་བཞིན་དུ་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་གྱི་སྟོང་པ་ཉིད་ཀྱིས་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྟོང་སྟེ། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའོ། །
en: Similarly, [they discern that] feelings conditioned by mentally compounded sensory contact are empty of the emptiness of feelings conditioned by mentally compounded sensory contact, and so forth, that the nature of feelings conditioned by mentally compounded sensory contact is emptiness, and that emptiness is indeed the feelings conditioned by mentally compounded sensory contact.

source: དེ་བཞིན་དུ་དྲན་པ་ཉེ་བར་གཞག་པའི་སྟོང་པ་ཉིད་ཀྱིས་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སྟོང་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སོ། །
en: “Similarly, [they discern that] the applications of mindfulness are empty of the emptiness of the applications of mindfulness, that the nature of the applications of mindfulness is emptiness, and that emptiness is indeed the applications of mindfulness.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་གྱི་སྟོང་པ་ཉིད་ཀྱིས། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྟོང་སྟེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའོ། །
en: [They discern that] the noble eightfold path and other [causal attributes] are empty of the emptiness of the noble eightfold path, that the nature of the noble eightfold path is emptiness, and that emptiness is indeed the noble eightfold path.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་སྟོང་པ་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་སྟོང་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: Similarly, they discern that the ten powers of the tathāgatas are empty of the emptiness of the ten powers of the tathāgatas, that the nature of the ten powers of the tathāgatas is emptiness, and that emptiness is indeed the ten powers of the tathāgatas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་གྱི་སྟོང་པ་ཉིད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སྟོང་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སོ་ཞེས་སོ་སོར་རྟོག་གོ། །
en: In the same vein, they discern that the eighteen distinct qualities of the buddhas [and other fruitional attributes] are empty of the eighteen distinct qualities of the buddhas, that the nature of the qualities of the buddhas is emptiness, and that emptiness is indeed the qualities of the buddhas.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཟབ་པ་ལགས་ཏེ།
en: This transcendent perfection of wisdom is profound.

source: ཐེག་པ་ལ་གསར་དུ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་འདི་ཐོས་ནས་སྐྲག་ཅིང་། དངང་ལ་དངང་བར་མི་འགྱུར་ལགས་གྲང་། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Would great bodhisattva beings who newly embark on the [Great] Vehicle, having heard this teaching on the transcendent perfection of wisdom, not possibly be afraid and terrified?”

source: ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་བའི་རྩ་བ་དག་བསྐྱེད་པ་ཡང་མ་ཡིན། སངས་རྒྱས་འབུམ་ཕྲག་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ་ཡང་མ་ཡིན། དགེ་བའི་རྩ་བ་མང་པོའི་ཉེ་བར་རྟོན་པས་ཉེ་བར་བརྟན་པ་ཡང་མ་ཡིན། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ་ཡང་མ་ཡིན། རྒྱ་ཆེན་པོ་ལ་མོས་པ་ཡང་མ་ཡིན། ལུས་དང་ཡིད་ཀྱི་གནས་ངན་ལེན་དང་བྲལ་བ་ཡང་མ་ཡིན། དགེ་བའི་རྩ་བ་འབར་བ་དང་ལྡན་པ་ཡང་མ་ཡིན། དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་འདི་ཐོས་ན་སྐྲག་ཅིང་དང་ང་ལ། དང་ང་བར་འགྱུར་རོ། །
en: The Blessed One then addressed the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, if great bodhisattva beings do not cultivate the roots of virtuous action, if they do not venerate many hundreds of thousands of buddhas, if they are not sustained by the instructions of the manifold roots of virtue, if they are not accepted by a spiritual mentor, if they are not inclined toward extensive [acts of virtuous conduct], if they are not free from wickedness of body, speech, and mind, and if they are not endowed with the fiery roots of virtue, they will be afraid and terrified on hearing this teaching concerning the transcendent perfection of wisdom.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་འདི་ནི་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ་རྣམས་དང་། སངས་རྒྱས་འབུམ་ཕྲག་མང་པོ་ལ་བསྙེན་བཀུར་མ་བྱས་པ་རྣམས་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་མ་ཟིན་པ་རྣམས་དང་། མོས་པ་མེད་པ་རྣམས་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པར་ལྷུང་བའི་བསམ་པ་ཅན་རྣམས་དང་། བརྩོན་འགྲུས་ཞན་པ་རྣམས་དང་། ལེ་ལོ་ཅན་རྣམས་དང་། སྲིད་པའི་བདེ་བ་མངོན་པར་འདོད་པ་རྣམས་ཀྱི་རྣ་ལམ་དུ་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་འདི་གྲག་པར་མི་འགྱུར་བའི་ཕྱིར་རོ། །
en: If you ask why, it is because this teaching on the transcendent perfection of wisdom will not sound like the transcendent perfection of wisdom to the ears of those who have not cultivated the roots of virtue, those who have not venerated many hundreds of thousands of buddhas, those who have not been accepted by a spiritual mentor, those who are disinclined, those who harbor thoughts of falling into the vehicles of the śrāvakas and pratyekabuddhas, those who are of feeble perseverance, those who are indolent, and those intent on mundane pleasures.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིད་ལ་བསླབ་པར་བྱའོ། །དེ་བཞིན་དུ་གཟུགས་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དང་། དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དང་། དེ་བཞིན་དུ་མིག་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དང་། དེ་བཞིན་དུ་ཡིད་ཀྱི་བར་དུ་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དང་། དེ་བཞིན་དུ་གཟུགས་རྣམས་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དང་། དེ་བཞིན་དུ་ཆོས་ཀྱི་བར་དུ་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དང་། དེ་བཞིན་དུ་མིག་གི་ཁམས་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་དུ་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དང་།
en: Śāradvatī­putra, so it is that great bodhisattva beings who seek to perfect the transcendent perfection of generosity should train in the transcendent perfection of wisdom.

source: དེ་བཞིན་དུ་མིག་གི་འདུས་ཏེ་རེག་པ་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་དུ་ཡོངས་སུ་ཤེས་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁོ་ན་ལ་བསླབ་པར་བྱའོ། །
en: “Similarly, those great bodhisattva beings who wish to comprehend physical forms, and similarly, those who wish to comprehend feelings, perceptions, formative predispositions, and consciousness; those who wish to comprehend the eyes, and similarly, those who wish to comprehend [the other sense organs], up to and including the mental faculty; and similarly, those who wish to comprehend sights, and likewise, those who wish to comprehend [the other sense objects], up to and including mental phenomena; and similarly, those who wish to comprehend the sensory element of the eyes, and in the same vein, those who wish to comprehend [the other sensory elements], up to and including the sensory element of mental consciousness; those who wish to comprehend sensory contact that is visually compounded, those who wish to comprehend feelings conditioned by sensory contact that is visually compounded, and in the same vein, those who wish to comprehend sensory contact that is mentally compounded, and those who wish to comprehend [others sorts of feelings], up to and including the feelings conditioned by sensory contact that is mentally compounded—all of these should train exclusively in the transcendent perfection of wisdom.

source: དེ་བཞིན་དུ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྤང་བར་འདོད་པ་དང་། འཇིག་ཚོགས་ལ་ལྟ་བ་སྤང་བར་འདོད་པ་དང་། དེ་བཞིན་དུ་ཐེ་ཚོམ་དང་། ཚུལ་ཁྲིམས་དང་། བརྟུལ་ཞུགས་མཆོག་ཏུ་འཛིན་པ་དང་། འདོད་པ་ལ་འདོད་ཆགས་དང་། གནོད་སེམས་སྤང་བར་འདོད་པ་དང་། གཟུགས་ཀྱི་འདོད་ཆགས་དང་། གཟུགས་མེད་པའི་འདོད་ཆགས་དང་། མ་རིག་པ་དང་། ང་རྒྱལ་དང་། རྒོད་པ་སྤང་བར་འདོད་པ་དང་། ཀུན་ཏུ་སྦྱོར་བ་དང་། བག་ལ་ཉལ་བ་དང་། ཀུན་ནས་ལྡང་བ་ཐམས་ཅད་སྤང་བར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁོ་ན་ལ་བསླབ་པར་བྱའོ། །
en: “Similarly, those who wish to abandon desire, hatred, and delusion; those who wish to abandon false views about perishable composites, and similarly, those who wish to abandon doubt, the sense of moral and ascetic supremacy, attachment to the world system of desire and malice; those who wish to abandon attachment to the world system of form, attachment to the world system of formlessness, fundamental ignorance, pride, and mental agitation; and those who wish to abandon all fetters, latent impulses, and obsessions—all of these should train exclusively in the transcendent perfection of wisdom.

source: དེ་བཞིན་དུ་ཟས་བཞི་ཡོངས་སུ་ཤེས་པར་འདོད་པ་དང་། དེ་བཞིན་དུ་སྦྱོར་བ་བཞི་དང་། ཆུ་བོ་བཞི་དང་། མདུད་པ་བཞི་དང་། ཕྱིན་ཅི་ལོག་བཞི་སྤང་བར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །
en: “Likewise, those who wish to comprehend the four nourishments, and similarly, to abandon the four bonds, the four torrents, the four knots, and the four misconceptions should train in the transcendent perfection of wisdom.

source: དེ་བཞིན་དུ་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དག་སྤང་བར་འདོད་པ་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བསྒྲུབ་པར་འདོད་པ་དང་། རྫོགས་པར་བྱེད་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁོ་ན་ལ་བསླབ་པར་བྱའོ། །དེ་བཞིན་དུ་བསམ་གཏན་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་།
en: Similarly, those great bodhisattva beings who wish to abandon the paths of the ten non-virtuous actions, those who wish to attain the genuine paths of the ten virtuous actions, and those who wish to perfect them, should all train exclusively in the transcendent perfection of wisdom.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་ལ་བསྒོམ་པར་འདོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་བསྒོམ་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁོ་ན་ལ་བསླབ་པར་བྱའོ། །
en: Similarly, those great bodhisattva beings who wish to meditate on the four applications of mindfulness [and the other causal attributes], up to and including the noble eightfold path, as well as those who wish to meditate on the ten powers of the tathāgatas and [the other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, should all train exclusively in the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འདོད་པ་དང་། དགེ་བའི་རྩ་བ་གང་དག་ཡོངས་སུ་རྫོགས་པས་ནམ་ཡང་ངན་སོང་གསུམ་པོ་དག་ཏུ་མི་ལྟུང་བ་དང་། རིགས་དམའ་བདག་ཏུ་ཡང་མི་སྐྱེ་བ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ཡང་ལྟུང་བར་མི་འགྱུར་བའི་དགེ་བའི་རྩ་བ་དེ་དག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁོ་ན་ལ་བསླབ་པར་བྱའོ། །
en: “Moreover, Śāradvatī­putra, those great bodhisattva beings who wish to fulfil the aspirations of all sentient beings, and who wish to fulfil the roots of virtue so that they never regress into the three lower realms, are never born among beings of inferior species or class, and never descend to the levels of the śrāvakas and pratyekabuddhas because they have perfected the roots of virtue, should all train exclusively in the transcendent perfection of wisdom.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ་ལས། བསླབ་པའི་ལེའུ་ཞེས་བྱ་སྟེ་དྲུག་པའོ།། །།
en: This completes the sixth chapter from “The Transcendent Perfection of Wisdom in Ten Thousand Lines,” entitled “Training.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དགེ་བའི་བཤེས་གཉེན་གང་གིས་ཡོངས་སུ་ཟིན་ན། དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་བསྟན་པ་འདི་ཐོས་ནས། མི་སྐྲག་མི་དངང་ཞིང་དངང་བར་མི་འགྱུར་ལ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ཡང་མི་ལྟུང་བར་མྱུར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་བའི་དགེ་བའི་བཤེས་གཉེན་གང་ལགས།
en: Who are the spiritual mentors who would enable great bodhisattva beings upon being accepted by a spiritual mentor to hear this teaching on the transcendent perfection of wisdom and not be afraid or terrified, and swiftly attain emancipation in omniscience, without ever descending to the levels of the śrāvakas and pratyekabuddhas?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་ནི་གང་གཟུགས་མི་རྟག་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: The Blessed One then addressed the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, the spiritual mentors to great bodhisattva beings are those who teach the doctrine that physical forms are impermanent, and who do so without apprehending anything.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་ལ།
en: Similarly, they teach the doctrine that feelings, perceptions, formative predispositions, and consciousness are impermanent, and do so without apprehending anything.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་གཏོགས་པར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་མི་བསྔོ་བ་སྟེ།
en: They do not dedicate these roots of virtue to the levels of the śrāvakas and pratyekabuddhas, but exclusively to omniscience.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་ཡིན་ནོ། །
en: These are the spiritual mentors to great bodhisattva beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་ནི་གང་གཟུགས་སྡུག་བསྔལ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: “Moreover, Śāradvatī­putra, the spiritual mentors to great bodhisattva beings teach the doctrine that physical forms are imbued with suffering, and they do so without apprehending anything.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་ཞེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་ལ།
en: Similarly, they teach the doctrine that that feelings, perceptions, formative predispositions, and consciousness are imbued with suffering, and do so without apprehending anything.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་གཏོགས་པར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་མི་བསྔོ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་ཡིན་ནོ། །
en: They do not dedicate these roots of virtue to the levels of the śrāvakas and pratyekabuddhas, but exclusively to omniscience.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་ནི། གང་གཟུགས་བདག་མེད་ཅེས་བྱ་བ་དང་། སྟོང་ཞེས་བྱ་བ་དང་། མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། སྨོན་པ་མེད་ཅེས་བྱ་བ་དང་། ཞི་ཞེས་བྱ་བ་དང་།
en: These are the spiritual mentors to great bodhisattva beings.

source: དབེན་ཞེས་བྱ་བ་དང་། རྣམ་པར་བྱང་ཞེས་བྱ་བ་དང་། སྐྱེ་བ་མེད་ཅེས་བྱ་བ་དང་། འགག་པ་མེད་ཅེས་བྱ་བ་དང་། དངོས་པོ་མེད་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་བདག་མེད་ཅེས་བྱ་བ་དང་།
en: “Moreover, Śāradvatī­putra, the spiritual mentors to great bodhisattva beings teach the doctrines that physical forms are not a self, that they are empty, that they are signless, that they are without aspirations, that they are calm, that they are void, that they are purified, that they are non-arising, that they are unceasing, and that they are non-entities, and they do so without apprehending anything.

source: སྟོང་ཞེས་བྱ་བ་དང་། མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། སྨོན་པ་མེད་ཅེས་བྱ་བ་དང་། ཞི་ཞེས་བྱ་བ་དང་། དབེན་ཞེས་བྱ་བ་དང་། རྣམ་པར་བྱང་ཞེས་བྱ་བ་དང་། སྐྱེ་བ་མེད་ཅེས་བྱ་བ་དང་། འགག་པ་མེད་ཅེས་བྱ་བ་དང་། དངོས་པོ་མེད་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་།
en: Similarly, they teach the doctrines that that feelings, perceptions, formative predispositions, and consciousness are not a self, that they are empty, that they are signless, that they are without aspirations, that they are calm, that they are void, that they are purified, that they are non-arising, that they are unceasing, and that they are non-entities, and they do so without apprehending anything.

source: དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་ལ། དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་གཏོགས་པར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་མི་བསྔོ་བ་སྟེ།
en: They do not dedicate these roots of virtue to the levels of the śrāvakas and pratyekabuddhas, but exclusively to omniscience.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་ནི་གང་མིག་མི་རྟག་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་།
en: “Moreover, Śāradvatī­putra, the spiritual mentors to great bodhisattva beings teach the doctrine that the eyes are impermanent, and they do so without apprehending anything.

source: དེ་བཞིན་དུ་ཡིད་ཀྱི་བར་དུ་མི་རྟག་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་ལ།
en: Similarly, they teach the doctrine that [the other sense organs], up to and including the mental faculty, are impermanent, and they do so without apprehending anything.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་གཏོགས་པར་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་མི་བསྔོ་བ་སྟེ།
en: They do not dedicate these roots of virtue to the levels of the śrāvakas and pratyekabuddhas, but exclusively to omniscience.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་ནི་གང་མིག་སྡུག་བསྔལ་ཞེས་བྱ་བ་དང་། བདག་མེད་ཅེས་བྱ་བ་དང་། སྟོང་ཞེས་བྱ་བ་དང་། མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། སྨོན་པ་མེད་ཅེས་བྱ་བ་དང་། ཞི་ཞེས་བྱ་བ་དང་། དབེན་ཞེས་བྱ་བ་དང་། རྣམ་པར་བྱང་ཞེས་བྱ་བ་དང་། སྐྱེ་བ་མེད་ཅེས་བྱ་བ་དང་། འགག་པ་མེད་ཅེས་བྱ་བ་དང་། དངོས་པོ་མེད་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་པ་དང་། ཡིད་ཀྱི་བར་དུ་ཡང་སྡུག་བསྔལ་ཞེས་བྱ་བ་དང་།
en: “Moreover, Śāradvatī­putra, the spiritual mentors to great bodhisattva beings teach the doctrine that the eyes are imbued with suffering, that they are not a self, that they are empty, that they are signless, that they are without aspirations, that they are calm, that they are void, that they are purified, that they are non-arising, that they are unceasing, and that they are non-entities, and they do so without apprehending anything.

source: བདག་མེད་ཅེས་བྱ་བ་དང་། སྟོང་ཞེས་བྱ་བ་དང་། མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། སྨོན་པ་མེད་ཅེས་བྱ་བ་དང་། ཞི་ཞེས་བྱ་བ་དང་། དབེན་ཞེས་བྱ་བ་དང་། རྣམ་པར་བྱང་ཞེས་བྱ་བ་དང་། སྐྱེ་བ་མེད་ཅེས་བྱ་བ་དང་། འགག་པ་མེད་ཅེས་བྱ་བ་དང་། དངོས་པོ་མེད་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་།
en: Also, they teach the doctrines that [the other sense organs], up to and including the mental faculty, are imbued with suffering, that they are not a self, that they are empty, that they are signless, that they are without aspirations, that they are calm, that they are void, that they are purified, that they are non-arising, that they are unceasing, and that they are non-entities, and they do so without apprehending anything.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་བའི་བཤེས་གཉེན་ནི་གང་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མི་རྟག་ཅེས་བྱ་བར་ཆོས་སྟོན་པ་དང་། དེ་བཞིན་དུ་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་དུ་མི་རྟག་ཅེས་བྱ་བར་ཆོས་སྟོན་ཅིང་།
en: “Moreover, Śāradvatī­putra, the spiritual mentors to great bodhisattva beings teach the doctrine that feelings conditioned by sensory contact that is visually compounded are impermanent, and similarly, that [the other aspects of feelings], up to and including feelings conditioned by sensory contact that is mentally compounded, are impermanent, and they do so without apprehending anything.

source: དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སྟོན་ལ་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་གཏོགས་པར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་མི་བསྔོ་བ་སྟེ།
en: They do not dedicate these roots of virtue to the levels of the śrāvakas and pratyekabuddhas, but exclusively to omniscience.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་ཡིན་ནོ། །དེ་བཞིན་དུ་སྡུག་བསྔལ་ཞེས་བྱ་བ་དང་།
en: These are the spiritual mentors to great bodhisattva beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་བཤེས་གཉེན་ཡིན་ནོ། །
en: These are the spiritual mentors to great bodhisattva beings.
